In [1]:
try:
  import string
  import pandas as pd
  import matplotlib.pyplot as plt

except Exception as e:
  print(f'Error importing: \n{e}')

In [8]:
col_names = ['country/region','new_cases','new_deaths','total_cases','total_deaths','total_recovery']
day1 = pd.read_csv('./data/jordan1.csv', names=col_names)
day2 = pd.read_csv('./data/jordan2.csv', names=col_names)
day3 = pd.read_csv('./data/jordan3.csv', names=col_names)
day4 = pd.read_csv('./data/jordan4.csv', names=col_names)

In [9]:
data = pd.concat([day1,day2,day3,day4])
data

   country/region new_cases  new_deaths total_cases total_deaths total_recovery
43         Jordan    +5,205          87     526,666        5,788        426,754
43         Jordan    +8,789          88     535,455        5,876        434,167
43         Jordan    +9,269         109     544,724        5,985            109
43         Jordan    +9,003          92     553,727        6,077             92

In [10]:
data.to_csv('./data/gen.csv')